{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1, 32], "name": "conv2d_32/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_32/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "conv2d_33/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_33/bias"}, {"dtype": "float32", "shape": [5, 5, 32, 32], "name": "conv2d_34/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_34/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_35/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_35/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_36/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_36/bias"}, {"dtype": "float32", "shape": [5, 5, 64, 64], "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_37/bias"}, {"dtype": "float32", "shape": [4, 4, 64, 128], "name": "conv2d_38/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_38/bias"}, {"dtype": "float32", "shape": [128, 62], "name": "dense_19/kernel"}, {"dtype": "float32", "shape": [62], "name": "dense_19/bias"}]}], "modelTopology": {"training_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 4.999999873689376e-06, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_32", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_33", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_34", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_35", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_36", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_37", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_38", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_10", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_19", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 62, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_12"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.9", "format": "layers-model"}